app/controllers/comments_controller.rb

  def create
    #/posts/:post_id/comments
     @post = Post.find params[:post_id]
     @comment = Comment.new comment_params
     @comment.post = @post
   if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "it is a great idea\r\n"], ["post_id", 2], ["created_at", "2020-07-27 06:02:26.949118"], ["updated_at", "2020-07-27 06:02:26.949118"]]

  def destroy
    #post_comment_path   #/posts/:post_id/comments/:id
    @comment = Comment.find params[:id]
    @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 10]]