app/controllers/posts_controller.rb

  def create
    @post = Post.new post_params
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Eviiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiil"], ["body", "I don't believe it "], ["created_at", "2020-07-26 19:29:08.067916"], ["updated_at", "2020-07-26 19:29:08.067916"]]

  def show
    @comment = Comment.new
    @comments = @post.comments.order(created_at: :desc)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 2]]

  def update
    if @post.update post_params
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "Ruby language Updated"], ["updated_at", "2020-07-27 05:44:50.524529"], ["id", 53]]

  def destroy
    flash[:notice] = "Post Deleted!"
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 53]]

  def find_post
    @post = Post.find params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 755], ["LIMIT", 1]]